; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=228, out_folder=./training, instance_id=36, seed=2060, goal_proportion=0.03

(define (problem blocksworld-36)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 - object)
 (:init 
    (arm-empty)
    (clear b170)
    (on-table b170)
    (clear b87)
    (on b87 b40)
    (on b40 b169)
    (on b169 b21)
    (on-table b21)
    (clear b110)
    (on b110 b202)
    (on-table b202)
    (clear b163)
    (on b163 b222)
    (on-table b222)
    (clear b49)
    (on b49 b166)
    (on b166 b44)
    (on b44 b98)
    (on b98 b192)
    (on b192 b22)
    (on b22 b45)
    (on b45 b187)
    (on-table b187)
    (clear b114)
    (on-table b114)
    (clear b107)
    (on b107 b33)
    (on b33 b84)
    (on b84 b207)
    (on b207 b41)
    (on b41 b70)
    (on b70 b154)
    (on b154 b150)
    (on-table b150)
    (clear b86)
    (on b86 b28)
    (on b28 b121)
    (on b121 b188)
    (on-table b188)
    (clear b139)
    (on b139 b185)
    (on-table b185)
    (clear b210)
    (on b210 b132)
    (on-table b132)
    (clear b34)
    (on-table b34)
    (clear b23)
    (on-table b23)
    (clear b63)
    (on b63 b78)
    (on-table b78)
    (clear b224)
    (on b224 b25)
    (on b25 b36)
    (on-table b36)
    (clear b127)
    (on-table b127)
    (clear b10)
    (on b10 b195)
    (on b195 b56)
    (on b56 b178)
    (on-table b178)
    (clear b13)
    (on-table b13)
    (clear b147)
    (on b147 b225)
    (on-table b225)
    (clear b198)
    (on b198 b103)
    (on-table b103)
    (clear b172)
    (on b172 b71)
    (on b71 b116)
    (on-table b116)
    (clear b3)
    (on b3 b20)
    (on b20 b183)
    (on b183 b123)
    (on b123 b31)
    (on-table b31)
    (clear b48)
    (on b48 b115)
    (on b115 b85)
    (on b85 b60)
    (on b60 b164)
    (on b164 b203)
    (on b203 b9)
    (on b9 b29)
    (on b29 b47)
    (on-table b47)
    (clear b37)
    (on b37 b190)
    (on b190 b88)
    (on b88 b200)
    (on b200 b181)
    (on b181 b173)
    (on-table b173)
    (clear b130)
    (on-table b130)
    (clear b1)
    (on-table b1)
    (clear b39)
    (on b39 b134)
    (on-table b134)
    (clear b209)
    (on b209 b156)
    (on-table b156)
    (clear b102)
    (on-table b102)
    (clear b64)
    (on-table b64)
    (clear b153)
    (on b153 b138)
    (on b138 b52)
    (on b52 b146)
    (on b146 b152)
    (on b152 b95)
    (on-table b95)
    (clear b14)
    (on-table b14)
    (clear b109)
    (on b109 b117)
    (on b117 b151)
    (on b151 b81)
    (on b81 b120)
    (on-table b120)
    (clear b35)
    (on-table b35)
    (clear b113)
    (on-table b113)
    (clear b6)
    (on b6 b54)
    (on b54 b168)
    (on-table b168)
    (clear b30)
    (on b30 b66)
    (on b66 b100)
    (on-table b100)
    (clear b193)
    (on b193 b15)
    (on-table b15)
    (clear b218)
    (on b218 b51)
    (on b51 b106)
    (on b106 b201)
    (on b201 b12)
    (on b12 b135)
    (on b135 b196)
    (on b196 b131)
    (on b131 b5)
    (on b5 b227)
    (on b227 b211)
    (on-table b211)
    (clear b165)
    (on-table b165)
    (clear b62)
    (on b62 b175)
    (on b175 b112)
    (on b112 b111)
    (on-table b111)
    (clear b93)
    (on-table b93)
    (clear b158)
    (on-table b158)
    (clear b101)
    (on b101 b216)
    (on b216 b189)
    (on b189 b32)
    (on b32 b73)
    (on b73 b149)
    (on b149 b26)
    (on b26 b65)
    (on b65 b177)
    (on b177 b157)
    (on-table b157)
    (clear b83)
    (on b83 b43)
    (on b43 b161)
    (on b161 b72)
    (on b72 b145)
    (on b145 b94)
    (on b94 b128)
    (on b128 b58)
    (on b58 b206)
    (on b206 b53)
    (on-table b53)
    (clear b90)
    (on b90 b91)
    (on-table b91)
    (clear b82)
    (on b82 b182)
    (on b182 b208)
    (on-table b208)
    (clear b140)
    (on b140 b162)
    (on b162 b97)
    (on b97 b11)
    (on-table b11)
    (clear b133)
    (on b133 b61)
    (on-table b61)
    (clear b223)
    (on b223 b155)
    (on b155 b160)
    (on b160 b176)
    (on b176 b212)
    (on-table b212)
    (clear b77)
    (on b77 b59)
    (on b59 b55)
    (on b55 b179)
    (on-table b179)
    (clear b197)
    (on-table b197)
    (clear b17)
    (on-table b17)
    (clear b217)
    (on b217 b27)
    (on b27 b184)
    (on-table b184)
    (clear b228)
    (on b228 b186)
    (on-table b186)
    (clear b99)
    (on b99 b8)
    (on b8 b92)
    (on b92 b137)
    (on b137 b38)
    (on b38 b79)
    (on-table b79)
    (clear b76)
    (on-table b76)
    (clear b119)
    (on b119 b24)
    (on b24 b126)
    (on-table b126)
    (clear b124)
    (on b124 b213)
    (on-table b213)
    (clear b42)
    (on b42 b69)
    (on b69 b215)
    (on b215 b74)
    (on b74 b226)
    (on-table b226)
    (clear b118)
    (on-table b118)
    (clear b136)
    (on b136 b220)
    (on-table b220)
    (clear b16)
    (on b16 b171)
    (on b171 b105)
    (on b105 b50)
    (on b50 b143)
    (on-table b143)
    (clear b67)
    (on-table b67)
    (clear b205)
    (on-table b205)
    (clear b89)
    (on-table b89)
    (clear b46)
    (on b46 b144)
    (on b144 b219)
    (on b219 b129)
    (on-table b129)
    (clear b80)
    (on b80 b57)
    (on-table b57)
    (clear b204)
    (on b204 b68)
    (on b68 b180)
    (on b180 b108)
    (on b108 b159)
    (on b159 b19)
    (on b19 b194)
    (on-table b194)
    (clear b221)
    (on-table b221)
    (clear b125)
    (on b125 b167)
    (on b167 b142)
    (on b142 b104)
    (on b104 b174)
    (on b174 b4)
    (on b4 b7)
    (on b7 b141)
    (on b141 b2)
    (on b2 b199)
    (on-table b199)
    (clear b122)
    (on b122 b18)
    (on b18 b96)
    (on-table b96)
    (clear b75)
    (on b75 b214)
    (on-table b214)
    (clear b191)
    (on b191 b148)
    (on-table b148))
 (:goal  (and 
    (clear b5)
    (on b5 b1)
    (on-table b1)
    (clear b2)
    (on b2 b3)
    (on b3 b6)
    (on-table b6)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b6 b54)
   deleted: (on b6 b54) (clear b6) (arm-empty)
   added: (holding b6) (clear b54)
   goals met: 1 of 9
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 9
3. (unstack b125 b167)
   deleted: (on b125 b167) (clear b125) (arm-empty)
   added: (holding b125) (clear b167)
   goals met: 2 of 9
4. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 2 of 9
5. (unstack b167 b142)
   deleted: (on b167 b142) (clear b167) (arm-empty)
   added: (holding b167) (clear b142)
   goals met: 2 of 9
6. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 2 of 9
7. (unstack b142 b104)
   deleted: (on b142 b104) (clear b142) (arm-empty)
   added: (holding b142) (clear b104)
   goals met: 2 of 9
8. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 2 of 9
9. (unstack b104 b174)
   deleted: (on b104 b174) (clear b104) (arm-empty)
   added: (holding b104) (clear b174)
   goals met: 2 of 9
10. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 2 of 9
11. (unstack b174 b4)
   deleted: (on b174 b4) (clear b174) (arm-empty)
   added: (holding b174) (clear b4)
   goals met: 3 of 9
12. (putdown b174)
   deleted: (holding b174)
   added: (clear b174) (arm-empty) (on-table b174)
   goals met: 3 of 9
13. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 2 of 9
14. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 9
15. (unstack b218 b51)
   deleted: (on b218 b51) (clear b218) (arm-empty)
   added: (holding b218) (clear b51)
   goals met: 4 of 9
16. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 4 of 9
17. (unstack b51 b106)
   deleted: (on b51 b106) (clear b51) (arm-empty)
   added: (holding b51) (clear b106)
   goals met: 4 of 9
18. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 4 of 9
19. (unstack b106 b201)
   deleted: (on b106 b201) (clear b106) (arm-empty)
   added: (holding b106) (clear b201)
   goals met: 4 of 9
20. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 4 of 9
21. (unstack b201 b12)
   deleted: (on b201 b12) (clear b201) (arm-empty)
   added: (holding b201) (clear b12)
   goals met: 4 of 9
22. (putdown b201)
   deleted: (holding b201)
   added: (clear b201) (arm-empty) (on-table b201)
   goals met: 4 of 9
23. (unstack b12 b135)
   deleted: (on b12 b135) (clear b12) (arm-empty)
   added: (holding b12) (clear b135)
   goals met: 4 of 9
24. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 9
25. (unstack b135 b196)
   deleted: (on b135 b196) (clear b135) (arm-empty)
   added: (holding b135) (clear b196)
   goals met: 4 of 9
26. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 4 of 9
27. (unstack b196 b131)
   deleted: (on b196 b131) (clear b196) (arm-empty)
   added: (holding b196) (clear b131)
   goals met: 4 of 9
28. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 4 of 9
29. (unstack b131 b5)
   deleted: (on b131 b5) (clear b131) (arm-empty)
   added: (holding b131) (clear b5)
   goals met: 5 of 9
30. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 5 of 9
31. (unstack b7 b141)
   deleted: (on b7 b141) (clear b7) (arm-empty)
   added: (holding b7) (clear b141)
   goals met: 5 of 9
32. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 9
33. (unstack b141 b2)
   deleted: (on b141 b2) (clear b141) (arm-empty)
   added: (holding b141) (clear b2)
   goals met: 6 of 9
34. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 6 of 9
35. (unstack b3 b20)
   deleted: (on b3 b20) (clear b3) (arm-empty)
   added: (holding b3) (clear b20)
   goals met: 6 of 9
36. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 7 of 9
37. (unstack b2 b199)
   deleted: (on b2 b199) (clear b2) (arm-empty)
   added: (holding b2) (clear b199)
   goals met: 6 of 9
38. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 8 of 9
39. (unstack b5 b227)
   deleted: (on b5 b227) (clear b5) (arm-empty)
   added: (holding b5) (clear b227)
   goals met: 7 of 9
40. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 9 of 9
